---
title: PointOnEdgeEdgeIntersection
classe: Autodesk.Revit.DB.PointOnEdgeEdgeIntersection
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.PointElementReference
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# PointOnEdgeEdgeIntersection

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Reference GetEdgeReference1()` | `pointOnEdgeEdgeIntersection.GetEdgeReference1()` | Reference |
| `Reference GetEdgeReference2()` | `pointOnEdgeEdgeIntersection.GetEdgeReference2()` | Reference |
| `Void SetEdgeReference1(Reference)` | `pointOnEdgeEdgeIntersection.SetEdgeReference1(edgeReference)` | Void |
| `Void SetEdgeReference2(Reference)` | `pointOnEdgeEdgeIntersection.SetEdgeReference2(edgeReference)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```